src/Catalogs/кфкПримерыСообщенийСпецификации/кфкПримерыСообщенийСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>кфкПримерыСообщенийСпецификации</name>
  <owners>Catalog.кфкТипыДанныхСпецификации</owners>
  <attributes>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/кфкИзмененияОбъектовСпецификаций/кфкИзмененияОбъектовСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкИзмененияОбъектовСпецификаций</name>
  <resources>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИзменений</name>
    <type>
      <types>EnumRef.кфкВидыИзмененияДанных</types>
    </type>
  </resources>
  <resources>
    <name>ВидПовышения</name>
    <type>
      <types>EnumRef.кфкВидыПовышенияВерсий</types>
    </type>
  </resources>
  <attributes>
    <name>БазоваяВерсия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.кфкСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.кфкКомпонентСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкВидыПовышенияВерсий/кфкВидыПовышенияВерсий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкВидыПовышенияВерсий</name>
  <enumValues>
    <name>ОсновнаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ДополняющаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ВерсияИсправления</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/кфкПримерыСообщенийСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПослеЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий)
	
	РегистрыСведений.кфкИзмененияОбъектовСпецификаций.ОбработкаЗаписиВерсийИсторииДанных(ИнформацияОЗаписиВерсий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьВидПовышения(Данные, История, ЭтоНовый) Экспорт
	
	ВидыПовышения = Перечисления.кфкВидыПовышенияВерсий;
	ИндексыПовышения = ВидыПовышения.Индексы();
	Результат = 9;
	
	Если ТипЗнч(История) = Тип("ИнформацияОЗаписиВерсииИсторииДанных") Тогда // Новый объект или удаление старого объекта
		Если ЭтоНовый Тогда
			Если История.ВидИзмененияДанных = ВидИзмененияДанных.Добавление Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Изменение Тогда
				ВидПовышения = ?(
					ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(История.ДанныеВерсии, "ПометкаУдаления", Ложь),
					ВидыПовышения.ПустаяСсылка(), ВидыПовышения.ДополняющаяВерсия);
				
			Иначе
				ВидПовышения = ВидыПовышения.ПустаяСсылка();
				
			КонецЕсли;
			
		ИначеЕсли История.ВидИзмененияДанных = ВидИзмененияДанных.Удаление Тогда
			ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
			
		Иначе
			ВызватьИсключение НСтр("ru = 'Недопустимый сценарий изменения!'");
			
		КонецЕсли;
		Результат = ИндексыПовышения.Найти(ВидПовышения);
		
	Иначе
		Для Каждого КлючЗначение Из История Цикл
			ИмяРеквизита = КлючЗначение.Ключ;
//			Изменения = КлючЗначение.Значение;
			
			Если ИмяРеквизита = "ПометкаУдаления" Тогда
				ВидПовышения = ВидыПовышения.ДополняющаяВерсия;
				
			ИначеЕсли ИмяРеквизита = "Наименование" Или ИмяРеквизита = "Тело" Тогда
				ВидПовышения = ВидыПовышения.ВерсияИсправления;
				
			Иначе
				ВызватьИсключение СтрШаблон(НСтр("ru = 'Неизвестное имя реквизита: %1'"), ИмяРеквизита);
			КонецЕсли;
			
			Результат = Мин(Результат, ИндексыПовышения.Найти(ВидПовышения));
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат ?(Результат = 9, -1, Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
